main/app/Helpers/Helper.php

select * from `sp_languages` where `status` = 0 limit 1
---
    public static function languageSelection($code)
    {
        $default = Language::where('status', 0)->first()->code;

select * from `sp_configurations` limit 1
---
    public static function config()
    {
        return Configuration::first();

select * from `sp_languages` order by `created_at` desc
---
    public static function languages()
    {
        return Language::latest()->get();

select * from `sp_configurations` limit 1
---
    public static function theme()
    {
        return 'frontend.' . Configuration::first()->theme . '.';

select * from `sp_contents` where `type` = 'iteratable' and `theme` = 'light' and `name` = 'about'
select * from `sp_contents` where `type` = 'non_iteratable' and `theme` = 'light' and `name` = 'about' limit 1
---
    public static function builder($section, $collection = false)
    {

        if ($collection) {
            return Content::where('type', 'iteratable')->where('theme', self::config()->theme)->where('name', $section)->get();
        }

        return Content::where('type', 'non_iteratable')->where('theme', self::config()->theme)->where('name', $section)->first();